#include "Rcc.h"
#include "STC8.h"

/*****************************************************************************
函数名称 : RCC_INIT(void)
功能描述 : 时钟初始化系统函数
输入参数 : 时钟频率：22.1184
返回参数 : 无
使用说明 : 此函数BSP_Init内部需调用;
版本:       V1.0, 2019-3-3           
*****************************************************************************/
void Init_Rcc(void)
{
	P_SW2  = 0x80; //外设端口切换寄存器2 -- 激活
	MCKSEL = 0x00; // 0:内部IRC24MHz时钟 01：外部时钟 11：内部32KHz低速IRC
	CLKDIV = 4;   // MCLK/1不分频,MCLK/2 两分频 ... ... MCLK/4 ... ... MCLK/255(最小)
	P_SW2  = 0x00; //外设端口切换寄存器2 -- 禁止
}